; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v4 - type_1 ?v3 - type_3)
 	      (pred_2 ?v2 - object ?v3 - type_3)
	      (pred_4 ?v4 - type_1 ?v1 - type_2)
	      (pred_1 ?v4 - type_1 ?v2 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v4 - type_1 ?v5 ?v6 - type_3)
       :precondition (and  (pred_3 ?v4 ?v5))
       :effect (and  (pred_3 ?v4 ?v6)
		     (not (pred_3 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_1 ?v7 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v8) (pred_3 ?v4 ?v8) (pred_4 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v8)) 
		    (not (pred_4 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_1 ?v7 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v1) (pred_3 ?v4 ?v8))
       :effect (and (pred_2 ?v7 ?v8)
		    (pred_4 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_06 - type_1
obj_05 obj_08 obj_12 obj_11 - type_2
obj_07 obj_10 obj_03 obj_13 - type_3
obj_02 obj_01 obj_09 - object)
(:init
(pred_3 obj_04 obj_10)
(pred_4 obj_04 obj_05)
(pred_4 obj_04 obj_08)
(pred_3 obj_06 obj_10)
(pred_4 obj_06 obj_12)
(pred_4 obj_06 obj_11)
(pred_2 obj_02 obj_07)
(pred_2 obj_01 obj_03)
(pred_2 obj_09 obj_10)
)
(:goal
(and
(pred_2 obj_02 obj_10)
(pred_2 obj_01 obj_10)
(pred_2 obj_09 obj_03)
)
)

(:constraints
  (always (not (pred_3 obj_04 obj_03)))
)
)

; plan
1. (op_3 obj_04 obj_09 obj_10 obj_08)
   deleted: (pred_2 obj_09 obj_10) (pred_4 obj_04 obj_08)
   added: (pred_1 obj_04 obj_09 obj_08)
   goals met: 0 of 3
2. (op_2 obj_06 obj_10 obj_07)
   deleted: (pred_3 obj_06 obj_10)
   added: (pred_3 obj_06 obj_07)
   goals met: 0 of 3
3. (op_3 obj_06 obj_02 obj_07 obj_11)
   deleted: (pred_2 obj_02 obj_07) (pred_4 obj_06 obj_11)
   added: (pred_1 obj_06 obj_02 obj_11)
   goals met: 0 of 3
4. (op_2 obj_06 obj_07 obj_10)
   deleted: (pred_3 obj_06 obj_07)
   added: (pred_3 obj_06 obj_10)
   goals met: 0 of 3
5. (op_1 obj_06 obj_02 obj_10 obj_11)
   deleted: (pred_1 obj_06 obj_02 obj_11)
   added: (pred_2 obj_02 obj_10) (pred_4 obj_06 obj_11)
   goals met: 1 of 3
6. (op_2 obj_06 obj_10 obj_03)
   deleted: (pred_3 obj_06 obj_10)
   added: (pred_3 obj_06 obj_03)
   goals met: 1 of 3
7. (op_3 obj_06 obj_01 obj_03 obj_11)
   deleted: (pred_2 obj_01 obj_03) (pred_4 obj_06 obj_11)
   added: (pred_1 obj_06 obj_01 obj_11)
   goals met: 1 of 3
8. (op_2 obj_06 obj_03 obj_10)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_10)
   goals met: 1 of 3
9. (op_1 obj_06 obj_01 obj_10 obj_11)
   deleted: (pred_1 obj_06 obj_01 obj_11)
   added: (pred_2 obj_01 obj_10) (pred_4 obj_06 obj_11)
   goals met: 2 of 3
10. (op_1 obj_04 obj_09 obj_10 obj_08)
   deleted: (pred_1 obj_04 obj_09 obj_08)
   added: (pred_2 obj_09 obj_10) (pred_4 obj_04 obj_08)
   goals met: 2 of 3
11. (op_3 obj_06 obj_09 obj_10 obj_11)
   deleted: (pred_2 obj_09 obj_10) (pred_4 obj_06 obj_11)
   added: (pred_1 obj_06 obj_09 obj_11)
   goals met: 2 of 3
12. (op_2 obj_06 obj_10 obj_03)
   deleted: (pred_3 obj_06 obj_10)
   added: (pred_3 obj_06 obj_03)
   goals met: 2 of 3
13. (op_1 obj_06 obj_09 obj_03 obj_11)
   deleted: (pred_1 obj_06 obj_09 obj_11)
   added: (pred_2 obj_09 obj_03) (pred_4 obj_06 obj_11)
   goals met: 3 of 3
